{
 "Problem_Name": " (10 pts) ALG (Binary Search Trees)",
 "Seen_On": "Fall 2017",
 "Problem_Statement": "(a) (6 pts) Following are three traversals produced by the exact same binary search tree.\n Using\nyour powers of inference, determine which one is which.\n (Fill in each blank with “in-order,”\n“pre-order,” “post-order.\n”) (Note: All sets of answers which don't contain each traversal\nexactly once will automatically be awarded 0 points.\n)\ntraversal: 18 14 12 9 31 24 19 22 23 36\ntraversal: 9 12 14 23 22 19 24 36 31 18\ntraversal: 9 12 14 18 19 22 23 24 31 36\n(b) (1 pt) What value must be at the root of the BST that produced the traversals listed in part (a)?\n(c) (1 pt) Using big-oh notation, what is the best-case runtime for searching for a particular value in\na BST with n nodes?\n(d) (1 pt) Using big-oh notation, what is the worst-case runtime for searching for a particular value\nin a binary tree (a regular old binary tree, not necessarily a BST) with n nodes?\n(e) (1 pt) Using big-oh notation, what is the worst-case runtime for searching for a particular value\nin a BST with n nodes?",
 "Problem_Code": "",
 "Solution": "preorder traversal: 18 14 12 9 31 24 19 22 23 36\npost-order traversal: 9 12 14 23 22 19 24 36 31 18\nin-order traversal: 9 12 14 18 19 22 23 24 31 36\nGrading: Each answer above is worth two points. However, if they try to game the system by\nputting the same answer in all three blanks, award zero points.\n(b) (1 pt) What value must be at the root of the BST that produced the traversals listed in part (a)?\n18\n(c) Using big-oh notation, what is the best-case runtime for searching for a particular value in a BST\nwith n nodes?\nO(1)\n(d) Using big-oh notation, what is the worst-case runtime for searching for a particular value in a\nbinary tree (a regular old binary tree, not necessarily a BST) with n nodes?\nO(n)\n(e) Using big-oh notation, what is the worst-case runtime for searching for a particular value in a\nBST with n nodes?\nO(n)\nGrading: For parts (b) through (e), each answer is worth 1 pt and is either right or wrong"
}